app/controllers/admins/sessions_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def create
    # Find admin by email
    @admin = Admin.find_by(email: params[:admin][:email])