app/views/books/_form.html.erb

SELECT "libraries".* FROM "libraries"
---
    <%= form.label :library_id %>
	<%= select("book", "library_id", Library.all.collect{|l| [l.name, l.id]})  %>