app/controllers/students/sessions_controller.rb

  def create
    # Find student by email
    @student = Student.find_by(email: params[:student][:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? ORDER BY "students"."id" ASC LIMIT ?  [["email", "jjjagtap@ncsu.edu"], ["LIMIT", 1]]