app/controllers/librarians/sessions_controller.rb

SELECT "librarians".* FROM "librarians" WHERE "librarians"."email" = ? ORDER BY "librarians"."id" ASC LIMIT ?  [["email", "lib@lib.com"], ["LIMIT", 1]]
---
  def create
    # Find librarian by email
    @librarian = Librarian.find_by(email: params[:librarian][:email])