app/controllers/books_controller.rb

  def search
    # Simple search that works with mock data
    query = params[:search].to_s.downcase

    if query.present?
      # Filter books based on the query
      @books = Book.all.select do |book|
---
SELECT "books".* FROM "books" WHERE (lower(published) LIKE '%201%')