app/controllers/libraries_controller.rb

SELECT "libraries".* FROM "libraries"
---
  def index
    @libraries = Library.all

INSERT INTO "libraries" ("name", "university", "location", "borrow_limit", "overdue_fines", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save

UPDATE "libraries" SET "name" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["name", "ferwet3"], ["updated_at", "2019-10-06 19:35:02.520111"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @library.update(library_params)

DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 3]]
---
  def destroy
    @library.destroy

SELECT "libraries".* FROM "libraries"
---
  def student_libraries_index
    @libraries = Library.all

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])