app/views/librarians/_form.html.erb

SELECT "libraries".* FROM "libraries"
---
    <%= form.label :library %>
    <%= select("librarian", "library", Library.all.collect{ |c| [ c.name] }) %>